
YTKA = "CAACAgIAAxkBAAEM2eJm7xFnQPkh1bDc-zXrTOyn4t4awgACAQEAAladvQoivp8OuMLmNDYE"

commands = """
Снизу я напишу команды, созданные специально для тебя:

/start - команда для начала работы бота.
/info - команда, которая показывает информацию о работе бота.
/help - команда, которая показывает все команды бота.
"""

info_var  = """
Вот тебе несколько вариантов:

(ps: впиши имя животного, которое тебе понравилось, а я покажу его описание и фотографию)
"""

text_info_from_who = """
Нужно подождать пока я соберу информацию с википедии...
"""

text_kto_takie = "Напиши мне о ком ты хочешь узнать? (Пример отправки:птицы)"

who = ("птицы", "млекопитающие", "гусеобразные", "журавлеобразные", "казуарообразные", "совообразные", "воробьинообразныe", "соколообразные",
       "ракшеобразные", "курообразные", "попугаеобразные", "пингвинообразные", "голубеобразные", "ржанкообразные", "фламингообразные"," дятлообразные",
       "аистообразныe", "кукушкообразные", "тураковые", "рептилии", "амфибии", "приматы", "насекомоядные", "рукокрылые", "грызуны", "ластоногие", 
       "даманы", "трубкозубовые", "неполнозубые", "хищные", "гепарнокопытные", "парнокопытные", "хоботные", "двурезцовые сумчатые", "китопарнокопытные", "мозоленогие", 
       "чешуйчатые", "крокодилы", "черепахи", "бесхвостые земноводные", "хвостатые земноводные")

START1 = """Привет! 👋 

Добро пожаловать в мир Московского зоопарка! Я – ваш личный гид в этом удивительном мире животных. 

Хотите узнать больше о наших питомцах, открыть для себя интересные факты о дикой природе и помочь им? Тогда вы попали по адресу! 

Вместе мы отправимся в увлекательное путешествие, где вы сможете познакомиться с каждым животным, узнать о его повадках и среде обитания. А чтобы выбрать своего любимца, я подготовил небольшой тест, который поможет вам найти самого подходящего подопечного. 

"""

START2 = """Готовы отправиться в путешествие? 😉"""

omosn ="""
Какое  животное  тебе  больше  всего  по  душе?  😉

1.  Птицы
2.  Млекопитающие
3.  Рептилии
4.  Амфибии

(ps:что бы выбрать впиши <<cd>>, пример:
cd Птицы)
"""

#---------------- птицы

testom1 ="""
Какой  отряд  птиц  тебе  больше  всего  нравится?  😉

1.  Гусеобразные
2.  Журавлеобразные
3.  Казуарообразные
4.  Совообразные
5.  Воробьинообразные 
6.  Соколообразные
7.  Ракшеобразные
8.  Курообразные
9.  Попугаеобразные
10.  Пингвинообразные
11.  Голубеобразные
12.  Ржанкообразные
13.  Фламингообразные
14.  Дятлообразные
15.  Аистообразные
16.  Кукушкообразные
17.  Тураковые

(ps: чтобы выбрать, впиши "cd" и название отряда, например: 
cd Гусеобразные)
"""


test1 = """
Гоголь -  самый  модный  из  всех  уток!  Он  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Малый Белый Гусь -  очень  застенчивый! Он  любит  прятаться  в  траве  и  наблюдать  за  миром  вокруг.  

Обыкновенная Кряква -  просто  умница!  Она  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Свиязь -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  крыльями.  

Серая Утка -  очень  забавный!  Он  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.

Чилиская Свиязь -  великий  мимик!  Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.  
"""

test2 = """
Белый Аист -  очень  заботливый  родитель! Он  часто  приносит  своим  детенышам  красивые  фрукты,  чтобы  те  украсили  свое  гнездо.  

Большая Выпь -  просто  умница!  Она  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Египетская Цапля -  великий  мимик! Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.  

Седлоклювый Ябиру -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  крыльями.  
"""

test3 = """
Водяной Павлин -  самый  модный  из  всех  павлинов!  Он  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Индийский Павлин -  очень  застенчивый!  Он  любит  прятаться  за  деревья  и  наблюдать  за  миром  вокруг.  

Зеленый Павлин -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Конголезский Павлин -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.  
"""

test4 = """
Золотая Рыбка -  очень  заботливый  родитель!  Она  часто  приносит  своим  детенышам  красивые  ракушки,  чтобы  те  украсили  свое  гнездо.  

Красная Рыбка -  просто  умница!  Она  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Линейная Рыбка -  настоящий  танцор!  Она  любит  танцевать  под  музыку  волн  и  раскачивать  своими  плавниками.  

Рыбка Ангел -  очень  забавный!  Она  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.
"""

test5 = """
Африканский Марабу -  настоящий  шутник! Он  обожает  играть  в  прятки  и  делать  смешные  звуки,  чтобы  запутать  своих  собратьев.  

Белый Аист -  очень  заботливый  родитель! Он  часто  приносит  своим  детенышам  красивые  фрукты,  чтобы  те  украсили  свое  гнездо.  

Большая Выпь -  просто  умница!  Она  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Египетская Цапля -  великий  мимик! Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.  

Седлоклювый Ябиру -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  крыльями.  
"""

test6 = """
Большая Шпорцевая Кукушка -  очень  заботливая!  Она  часто  приносит  своим  детенышам  красивые  камушки,  чтобы  те  украсили  свое  гнездо. 
"""

test7 = """
Боливийская Мирикина -  самая  модная  из  всех  обезьян! Она  любит  украшать  свои  перья  яркими  бусинками  и  показывать  свой  стиль  всем  вокруг.  

Золотистый Львиный Тамарин -  очень  застенчивый!  Он  любит  прятаться  за  деревья  и  наблюдать  за  миром  вокруг.  

Краснорукий Тамарин -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Лемур Кошачий -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.  
"""

test8 = """
Белогрудый еж -  настоящий  художник!  Он  любит  рисовать  забавные  картинки  на  земле  своими  когтями.

Ушастый еж -  очень  застенчивый! Он  любит  прятаться  в  траве  и  наблюдать  за  миром  вокруг.  
"""

test9 = """
Двухцветный Кожан - настоящий  модник!  Он  любит  украшать  свои  крылья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Нильский Крылан -  очень  заботливый! Он  часто  приносит  своим  детенышам  красивые  фрукты,  чтобы  те  украсили  свое  гнездо.  

Очковый Листонос -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  
"""

test10 = """
Капибара -  самый  веселый  из  всех  грызунов!  Он  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными. 

Капская Земляная Белка -  очень  заботливый!  Она  часто  приносит  своим  детенышам  красивые  ракушки,  чтобы  те  украсили  свое  гнездо.  

Мышь-Малютка -  просто  умница!  Она  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Обыкновенный Бобр -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.
"""

test11 = """
Морж -  самый  модный  из  всех  морских  животных!  Он  любит  украшать  свои  клыки  яркими  ракушками  и  показывать  свой  стиль  всем  вокруг.  

Морской Заяц -  очень  застенчивый!  Он  любит  прятаться  в  водорослях  и  наблюдать  за  миром  вокруг.  

Северный Морской Котик -  просто  умница!  Он  умеет  прятать  морских  звезд  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  
"""

test12 = """
Даман Брюса -  настоящий  модник!  Он  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  
"""

test13 = """
Гвинейский Турако - настоящий  модник!  Он  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Фиолетовый Турако -  очень  застенчивый! Он  любит  прятаться  за  деревья  и  наблюдать  за  миром  вокруг.  
"""

test14 = """
Капский Трубкозуб -  великий  мимик! Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.
"""

test15 = """
Четырехпалый Муравьед (Тамандуа) -  очень  застенчивый! Он  любит  прятаться  за  деревья  и  наблюдать  за  миром  вокруг.  
"""

test16 = """
Белогрудый ёж -  настоящий  художник!  Он  любит  рисовать  забавные  картинки  на  земле  своими  когтями.

Ушастый ёж -  очень  застенчивый! Он  любит  прятаться  в  траве  и  наблюдать  за  миром  вокруг.  
"""


#---------------- млекопетающие

testom2 ="""
Какой  отряд  млекопитающих  тебе  больше  всего  нравится?  😉

1.  Приматы
2.  Насекомоядные
3.  Рукокрылые
4.  Грызуны
5.  Ластоногие
6.  Даманы
7.  Трубкозубовые
8.  Неполнозубые
9.  Хищные
10.  Непарнокопытные
11.  Парнокопытные
12.  Хоботные
13.  Двурезцовые сумчатые
14.  Китопарнокопытные
15.  Мозоленогие

(ps: чтобы выбрать, впиши "cd" и название отряда, например: 
cd Приматы)
"""


test17a = """
Амурский Тигр -  настоящий  художник!  Он  любит  рисовать  забавные  картинки  на  снегу  своими  когтями. 

Белый Медведь -  очень  застенчивый!  Он  любит  прятаться  в  снежных  пещерах  и  наблюдать  за  миром  вокруг.

Бинтуронг -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.

Большая Панда -  великий  мимик!  Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.  

Бурая Гиена -  самый  модный  из  всех  гиен!  Она  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.

Восточно-Сибирская Рысь -  очень  заботливый!  Он  часто  приносит  своим  детенышам  красивые  ракушки,  чтобы  те  украсили  свое  гнездо.

Гривистый Волк -  просто  умница!  Он  умеет  пользоваться  инструментами,  например,  палками,  чтобы  достать  до  пищи  в  трудных  местах.

Дальневосточный Леопард -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.

Европейский Волк -  очень  забавный!  Он  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.

Енот-Полоскун -  великий  мимик!  Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.  

Енотовидная Собака -  самый  модный  из  всех  собак!  Она  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.

Индийский Лев -  очень  заботливый!  Он  часто  приносит  своим  детенышам  красивые  ракушки,  чтобы  те  украсили  свое  гнездо.

Камышовый Кот -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.
"""

test17b = """
Красный Волк -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.

Кустарниковая Собака -  очень  забавный!  Он  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.

Лесная Куница -  великий  мимик!  Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.  

Малая Панда -  самый  модный  из  всех  панды!  Она  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.

Манул -  очень  заботливый!  Он  часто  приносит  своим  детенышам  красивые  ракушки,  чтобы  те  украсили  свое  гнездо.

Медоед -  просто  умница!  Он  умеет  пользоваться  инструментами,  например,  палками,  чтобы  достать  до  пищи  в  трудных  местах.

Носуха -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.

Обыкновенная Лисица -  очень  забавный!  Он  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.

Обыкновенный Шакал -  великий  мимик!  Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.  

Песец -  самый  модный  из  всех  песцов!  Она  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.

Полосатая Гиена -  очень  заботливый!  Он  часто  приносит  своим  детенышам  красивые  ракушки,  чтобы  те  украсили  свое  гнездо.

Пума -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.

Серый Тюлень -  настоящий  танцор!  Он  любит  танцевать  под  музыку  волн  и  раскачивать  своими  плавниками.

Сивуч -  очень  забавный!  Он  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.

Соболь -  великий  мимик!  Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.

Сурикат -  самый  модный  из  всех  сурикатов!  Он  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.

Уссурийская Харза -  очень  заботливый!  Он  часто  приносит  своим  детенышам  красивые  ракушки,  чтобы  те  украсили  свое  гнездо.

Уссурийский Белогрудый (Гималайский) Медведь -  просто  умница!  Он  умеет  пользоваться  инструментами,  например,  палками,  чтобы  достать  до  пищи  в  трудных  местах.

Южноевропейский Шакал -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.
"""

test18 = """
Зебра Греви -  настоящий  модник!  Она  любит  украшать  свои  полоски  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Осёл -  очень  заботливый! Он  часто  приносит  своим  детенышам  красивые  фрукты,  чтобы  те  украсили  свое  гнездо.  

Осёл Домашний -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Равнинный Тапир -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.  
"""

test19 = """
Голубой Баран -  самый  модный  из  всех  баранов!  Он  любит  украшать  свои  рога  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Дагестанский Тур -  очень  заботливый! Он  часто  приносит  своим  детенышам  красивые  ракушки,  чтобы  те  украсили  свое  гнездо.  

Двугорбый Верблюд -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Канадский Овцебык -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.  

Карликовый Бегемот -  очень  забавный!  Он  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.

Обыкновенный Дикдик -  великий  мимик!  Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.

Северный Лесной Олень -  самый  модный  из  всех  оленей!  Он  любит  украшать  свои  рога  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.

Сычуаньский Такин -  очень  заботливый!  Он  часто  приносит  своим  детенышам  красивые  ракушки,  чтобы  те  украсили  свое  гнездо.

Таджикский Винторогий Козел (Мархур) -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.

Южноафриканская Черная Антилопа -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.  
"""

test20 = """
Азиатский Слон -  самый  умный  из  всех  слонов!  Он  любит  решать  загадки  и  очень  любит  решать  логические  задачи. 
"""

test21 = """
Кенгуру Беннета -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами. 
"""

test22 = """
Большой Оленёк -  самый  модный  из  всех  оленей!  Он  любит  украшать  свои  рога  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.

Домашний Як -  очень  заботливый! Он  часто  приносит  своим  детенышам  красивые  фрукты,  чтобы  те  украсили  свое  гнездо.

Южноафриканский Жираф -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.
"""

test23 = """
Альпака -  настоящий  модник!  Она  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг. 
"""

test24 = """
Обыкновенный Удав -  самый  модный  из  всех  удавав!  Он  любит  украшать  свои  чешуйки  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Парагвайская Анаконда -  очень  застенчивый!  Он  любит  прятаться  в  воде  и  наблюдать  за  миром  вокруг.  

Сетчатый Питон -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Темный Тигровый Питон -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.  
"""

test25 = """
Гавиаловый Крокодил -  самый  модный  из  всех  крокодилов!  Он  любит  украшать  свои  чешуйки  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Гладколобый Кайман -  очень  застенчивый!  Он  любит  прятаться  в  воде  и  наблюдать  за  миром  вокруг.  

Китайский Алligator -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Нильский Крокодил -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.  

Сиамский Крокодил -  очень  забавный!  Он  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.

Тупорылый Крокодил -  великий  мимик!  Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.

Черный Кайман -  самый  модный  из  всех  кайманов!  Он  любит  украшать  свои  чешуйки  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.
"""

test26 = """
Лучистая Черепаха -  самый  модный  из  всех  черепах!  Она  любит  украшать  свои  панцири  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Слоновая Черепаха -  очень  застенчивый!  Она  любит  прятаться  в  песке  и  наблюдать  за  миром  вокруг.
"""

test27 = """
Африканский Водонос (Роющая Лягушка) -  самый  модный  из  всех  лягушек!  Она  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Веслоног Денниси -  очень  застенчивый!  Он  любит  прятаться  в  воде  и  наблюдать  за  миром  вокруг.  

Голубой Древолаз -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Дальневосточная Квакша -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  лапками.  

Жаба-Ага -  очень  забавный!  Он  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.

Зеленая Жаба -  великий  мимик!  Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.

Красноглазая Квакша -  самый  модный  из  всех  квакш!  Она  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.

Монгольская Жаба -  очень  заботливый!  Он  часто  приносит  своим  детенышам  красивые  ракушки,  чтобы  те  украсили  свое  гнездо.

Сверчкова Жаба -  просто  умница!  Он  умеет  пользоваться  инструментами,  например,  палками,  чтобы  достать  до  пищи  в  трудных  местах.
"""

test28 = """
Огненная Саламандра -  самый  модный  из  всех  саламандр!  Она  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Трехпалая Амфиума -  очень  застенчивый!  Он  любит  прятаться  в  воде  и  наблюдать  за  миром  вокруг. 
"""

test29 = """
Гоголь -  самый  модный  из  всех  уток!  Он  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Малый Белый Гусь -  очень  застенчивый! Он  любит  прятаться  в  траве  и  наблюдать  за  миром  вокруг.  

Обыкновенная Кряква -  просто  умница!  Она  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Свиязь -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  крыльями.  

Серая Утка -  очень  забавный!  Он  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.

Чилиская Свиязь -  великий  мимик!  Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.  
"""

test30 = """
Белый Аист -  очень  заботливый  родитель! Он  часто  приносит  своим  детенышам  красивые  фрукты,  чтобы  те  украсили  свое  гнездо.  

Большая Выпь -  просто  умница!  Она  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Египетская Цапля -  великий  мимик! Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.  

Седлоклювый Ябиру -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  крыльями.  
"""

test31 = """
Водяной Павлин -  самый  модный  из  всех  павлинов!  Он  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Индийский Павлин -  очень  застенчивый!  Он  любит  прятаться  за  деревья  и  наблюдать  за  миром  вокруг.  

Зеленый Павлин -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Конголезский Павлин -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.  
"""

test32 = """
Золотая Рыбка -  очень  заботливый  родитель!  Она  часто  приносит  своим  детенышам  красивые  ракушки,  чтобы  те  украсили  свое  гнездо.  

Красная Рыбка -  просто  умница!  Она  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Линейная Рыбка -  настоящий  танцор!  Она  любит  танцевать  под  музыку  волн  и  раскачивать  своими  плавниками.  

Рыбка Ангел -  очень  забавный!  Она  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.
"""
#---------------- рептилии

testom3 ="""
Какой  отряд  рептилий  тебе  больше  всего  нравится?  😉

1.  Чешуйчатые
2.  Крокодилы
3.  Черепахи

(ps: чтобы выбрать, впиши "cd" и название отряда, например: 
cd Чешуйчатые)
"""


test33 = """
Обыкновенный Удав: Обыкновенный Удав -  самый  модный  из  всех  удавав!  Он  любит  украшать  свои  чешуйки  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Парагвайская Анаконда: Парагвайская Анаконда -  очень  застенчивый!  Он  любит  прятаться  в  воде  и  наблюдать  за  миром  вокруг.  

Сетчатый Питон: Сетчатый Питон -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Темный Тигровый Питон:  Темный Тигровый Питон -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.  
"""

test34 = """
Гавиаловый Крокодил: Гавиаловый Крокодил -  самый  модный  из  всех  крокодилов!  Он  любит  украшать  свои  чешуйки  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Гладколобый Кайман: Гладколобый Кайман -  очень  застенчивый!  Он  любит  прятаться  в  воде  и  наблюдать  за  миром  вокруг.  

Китайский Алligator: Китайский Алligator -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Нильский Крокодил:  Нильский Крокодил -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  хвостами.  

Сиамский Крокодил:  Сиамский Крокодил -  очень  забавный!  Он  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.

Тупорылый Крокодил:  Тупорылый Крокодил -  великий  мимик!  Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.

Черный Кайман: Черный Кайман -  самый  модный  из  всех  кайманов!  Он  любит  украшать  свои  чешуйки  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.
"""

test35 = """
Лучистая Черепаха: Лучистая Черепаха -  самый  модный  из  всех  черепах!  Она  любит  украшать  свои  панцири  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Слоновая Черепаха: Слоновая Черепаха -  очень  застенчивый!  Она  любит  прятаться  в  песке  и  наблюдать  за  миром  вокруг.
"""
#---------------- Амфибии

testom4 ="""
Какой  отряд  амфибий  тебе  больше  всего  нравится?  😉

1.  Бесхвостые земноводные
2.  Хвостатые земноводные

(ps: чтобы выбрать, впиши "cd" и название отряда, например: 
cd Бесхвостые земноводные)
"""


test36 = """
Африканский Водонос (Роющая Лягушка) -  самый  модный  из  всех  лягушек!  Она  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Веслоног Денниси -  очень  застенчивый!  Он  любит  прятаться  в  воде  и  наблюдать  за  миром  вокруг.  

Голубой Древолаз -  просто  умница!  Он  умеет  прятать  семена  и  орехи  в  тайных  местах,  чтобы  не  забыть  о  них  позже.  

Дальневосточная Квакша -  настоящий  танцор!  Он  любит  танцевать  под  музыку  ветра  и  раскачивать  своими  лапками.  

Жаба-Ага -  очень  забавный!  Он  любит  делать  смешные  звуки  и  устраивать  вечеринки  с  другими  животными.

Зеленая Жаба -  великий  мимик!  Он  умеет  подражать  звукам  окружающего  мира,  включая  человеческую  речь,  и  любит  устраивать  концерты  для  своих  собратьев.

Красноглазая Квакша -  самый  модный  из  всех  квакш!  Она  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.

Монгольская Жаба -  очень  заботливый!  Он  часто  приносит  своим  детенышам  красивые  ракушки,  чтобы  те  украсили  свое  гнездо.

Сверчкова Жаба -  просто  умница!  Он  умеет  пользоваться  инструментами,  например,  палками,  чтобы  достать  до  пищи  в  трудных  местах.
"""

test37 = """
Огненная Саламандра -  самый  модный  из  всех  саламандр!  Она  любит  украшать  свои  перья  яркими  цветами  и  показывать  свой  стиль  всем  вокруг.  

Трехпалая Амфиума -  очень  застенчивый!  Он  любит  прятаться  в  воде  и  наблюдать  за  миром  вокруг. 
"""
go_to_site = "Конечно без проблем, нажми на кнопку ниже и ты отправишься на сайт,или назад и ты отправишься в меню."

nazad = "Конечно,ты в главном меню."

not_found = "Прости,я не понял о чем ты. Напиши еще раз только без ошибок."

responses = {
    "пройти тест": omosn,
    "пройти еще раз": omosn,
    "cd птицы": testom1,
    "cd гусеобразные": [info_var, test1],
    "cd журавлеобразные": [info_var, test2],
    "cd казуарообразные": [info_var, test3],
    "cd совообразные": [info_var, test4],
    "cd воробьинообразные": [info_var, test5,],
    "cd моколообразные": [info_var, test6,],
    "cd ракшеобразные": [info_var, test7,],
    "cd курообразные": [info_var, test8,],
    "cd попугаеобразные": [info_var, test9,],
    "cd пингвинообразные": [info_var, test10],
    "cd голубеобразные": [info_var, test11],
    "cd ржанкообразные": [info_var, test12],
    "cd фламингообразные": [info_var, test13],
    "cd дятлообразные": [info_var, test14],
    "cd аистообразные": [info_var, test15],
    "cd кукушкообразные": [info_var, test16],
    "cd тураковые": [info_var, test17a, test17b],
    "cd млекопитающие": testom2,
    "cd приматы": [info_var, test18],
    "cd насекомоядные": [info_var, test19],
    "cd рукокрылые": [info_var, test20],
    "cd грызуны": [info_var, test21],
    "cd ластоногие": [info_var, test22],
    "cd даманы": [info_var, test23],
    "cd трубкозубовые": [info_var, test24],
    "cd неполнозубые": [info_var, test25],
    "cd хищные": [info_var, test26],
    "cd непарнокопытные": [info_var, test27],
    "cd парнокопытные": [info_var, test28],
    "cd хоботные": [info_var, test29],
    "cd двурезцовые сумчатые": [info_var, test30],
    "cd китопарнокопытные": [info_var, test31],
    "cd мозоленогие": [info_var, test32],
    "cd рептилии": testom3,
    "cd чешуйчатые": [info_var, test33],
    "cd крокодилы": [info_var, test34],
    "cd черепахи": [info_var, test35],
    "cd рептилии амфибии": testom4,
    "бесхвостые земноводные": [info_var, test36],
    "хвостатые земноводные": [info_var, test37],
    "назад": nazad,
    "кто такие...": text_kto_takie,
    "начать тест": omosn
}

